	IDENTIFICATION DIVISION.
	PROGRAM-ID. ALGO4.

	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	SELECT CONS1 ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_CONS1.
	SELECT CONS2 ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_CONS2.
	SELECT CONS3 ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_CONS3.
	SELECT CUENTAS ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_CTAS.
	SELECT ESTADOS ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_EST.
	SELECT MAESTRO ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_MAE.
	SELECT LISTADO ASSIGN TO DISK
					ORGANIZATION IS LINE SEQUENTIAL
					FILE STATUS IS FS_LIST.

	DATA DIVISION.
	FILE SECTION.
	FD CONS1
			LABEL RECORD IS STANDARD
			VALUE OF FILE-ID IS "cons1.dat".
			 
	01 CONS.	
	   03 CONS-CUIT-CONS          PIC 9(15).
	   03 CONS-FECHA-ALTA         PIC X(10).
	   03 CONS-FECHA-BAJA         PIC X(10).
	   03 CONS-ESTADO             PIC 9(02).
	   03 CONS-NOMBRE-CONSORCIO   PIC X(30).
	   03 CONS-TEL                PIC X(15).
	   03 CONS-DIR                PIC X(30).

	FD CONS2
			LABEL RECORD IS STANDARD
			VALUE OF FILE-ID IS "cons2.dat".
	01 CONS.	
	   03 CONS-CUIT-CONS          PIC 9(15).
	   03 CONS-FECHA-ALTA         PIC X(10).
	   03 CONS-FECHA-BAJA         PIC X(10).
	   03 CONS-ESTADO             PIC 9(02).
	   03 CONS-NOMBRE-CONSORCIO   PIC X(30).
	   03 CONS-TEL                PIC X(15).
	   03 CONS-DIR                PIC X(30).

	FD CONS3
			LABEL RECORD IS STANDARD
			VALUE OF FILE-ID IS "cons3.dat".
	01 CONS.	
	   03 CONS-CUIT-CONS          PIC 9(15).
	   03 CONS-FECHA-ALTA         PIC X(10).
	   03 CONS-FECHA-BAJA         PIC X(10).
	   03 CONS-ESTADO             PIC 9(02).
	   03 CONS-NOMBRE-CONSORCIO   PIC X(30).
	   03 CONS-TEL                PIC X(15).
	   03 CONS-DIR                PIC X(30).

	FD CUENTAS LABEL RECORD IS STANDARD
	           VALUE OF FILE-ID IS "cuentas.dat".

	01 CTA. 
	   03 CTA-CUIT-CONS           PIC 9(15).
	   03 CTA-NRO-CTA             PIC 9(08).
	   03 CTA-FECHA-ALTA          PIC X(10).
	   03 CTA-ENTIDAD             PIC 9(03).
	   03 CTA-SUCURSAL            PIC 9(03).

	FD ESTADOS LABEL RECORD IS STANDARD
	           VALUE OF FILE-ID IS "estados.dat".   

	01 EST.
	   03 EST-ESTADO              PIC 9(02).
	   03 EST-DESCRIP             PIC X(15).

	FD MAESTRO LABEL RECORD IS STANDARD
	           VALUE OF FILE-ID IS "maestro.dat".

	01 MAE.
	   03 MAE-CUIT-CONS           PIC 9(15).
	   03 MAE-FECHA-ALTA          PIC X(10).
	   03 MAE-DESCRIP-ESTADO      PIC X(15).
	   03 MAE-NOMBRE-CONSORCIO    PIC X(30).
	   03 MAE-TEL                 PIC X(15).
	   03 MAE-DIR                 PIC X(30).
	   03 MAE-NRO-CTA             PIC 9(08).

	FD LISTADO LABEL RECORD IS STANDARD
				VALUE OF FILE-ID IS "listado.dat".
	01 LINEA PIC X(80).

	WORKING-STORAGE SECTION.

	77 FS_CONS1 PIC XX.
	77 FS_CONS2 PIC XX.
	77 FS_CONS3 PIC XX.
	77 FS_CTAS	PIC XX.
	77 FS_EST	PIC XX.
	77 FS_MAE	PIC XX.
	77 FS_LIST	PIC XX.
	
	77 cantConsorcios 	PIC 99 VALUE 0.
	77 bajas 			PIC 99 VALUE 0.
	77 cantLineas 		PIC 99 VALUE 0.
	77 cantHojas 		PIC 99 VALUE 1.
	77 cantCons1 		PIC 99 VALUE 0.
	77 cantCons2 		PIC 99 VALUE 0.
	77 cantCons3 		PIC 99 VALUE 0.
	77 CANTESTADOS 		PIC 99 VALUE 0.
	77 CONT_ANIO 		PIC 99 VALUE 0.

	PROCEDURE DIVISION.
		perform ABRIR-ARCHIVOS.
		perform GEN-TABLA-ESTADOS.
		perform LEO-CONSORCIOS.
		perform LEO-CUENTAS.
		perform IMPRIMO-ENCABEZADO.
		perform CICLO-CONSORCIO.
		perform IMPRIMO-BAJAS.
		perform MOSTRAR-ESTADISTICAS.
		perform CERRAR-ARCHIVOS.
	STOP RUN.

	ABRIR-ARCHIVOS.
		DISPLAY "ABRIR-ARCHIVOS".
		OPEN INPUT CONS1.
		IF FS_CONS1 NOT = ZERO
			DISPLAY "Error en open CONS1. FS: " FS_CONS1
			STOP RUN.
		OPEN INPUT CONS2.
		IF FS_CONS2 NOT = ZERO
			DISPLAY "Error en open CONS2. FS: " FS_CONS2
			STOP RUN.
		OPEN INPUT CONS3.
		IF FS_CONS3 NOT = ZERO
			DISPLAY "Error en open CONS3. FS: " FS_CONS3
			STOP RUN.
		OPEN INPUT CUENTAS.
		IF FS_CTAS NOT = ZERO
			DISPLAY "Error en open CUENTAS - FS:" FS_CTAS
			STOP RUN.
		OPEN INPUT ESTADOS.
		IF FS_EST NOT = ZERO
			DISPLAY "Error en open ESTADOS - FS:" FS_EST
			STOP RUN.
		OPEN INPUT MAESTRO.
		IF FS_MAE NOT = ZERO
			DISPLAY "Error en open MAESTRO - FS:" FS_MAE
			STOP RUN.
		OPEN OUTPUT LISTADO.

	GEN-TABLA-ESTADOS.
		DISPLAY "GEN-TABLA-ESTADOS".
	LEO-CONSORCIOS.
		DISPLAY "LEO-CONSORCIOS".
	LEO-CUENTAS.
		DISPLAY "LEO-CUENTAS".
	IMPRIMO-ENCABEZADO.
		DISPLAY "IMPRIMO-ENCABEZADO".
	IMPRIMO-BAJAS.
		DISPLAY "IMPRIMO-BAJAS".
	CICLO-CONSORCIO.
		DISPLAY "CICLO-CONSORCIO".
	MOSTRAR-ESTADISTICAS.
		DISPLAY "MOSTRAR-ESTADISTICAS".
	CERRAR-ARCHIVOS.
		DISPLAY "CERRAR-ARCHIVOS".


----------------------------------------