       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEECUITP.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
           SELECT CUITPROV ASSIGN TO DISK
                                ORGANIZATION IS INDEXED
                                ACCESS MODE IS SEQUENTIAL
                                RECORD KEY IS CPR-CLAVE
                                FILE STATUS IS FS-CPR.
								
       DATA DIVISION.
       FILE SECTION.               

       FD CUITPROV LABEL RECORD IS STANDARD
                   VALUE OF FILE-ID IS 
                   "C:\PROVS\cuitprov.dat".
       
       01 CPR.
           03 CPR-CLAVE.
              05 CPR-CUIT-CONS                PIC 9(15).
              05 CPR-COD-PROV                 PIC 9(08).
           03 CPR-FECHA-ALTA                  PIC 9(08).      

       WORKING-STORAGE SECTION.
       77 FS-PSEQ		        PIC XX.       
       77 FS-CPR                PIC XX.       
                
       PROCEDURE DIVISION.
       DECLARATIVES.
       DECLAR-INPUT SECTION.
       USE AFTER ERROR PROCEDURE ON INPUT.
       CONTINUE-INPUT.
           CONTINUE.
       DECLAR-OUTPUT SECTION.
       USE AFTER ERROR PROCEDURE ON OUTPUT.
       CONTINUE-OUTPUT.
           CONTINUE.
       DECLAR-IO SECTION.
       USE AFTER ERROR PROCEDURE ON I-O.
       CONTINUE-IO.
           CONTINUE.
       DECLAR-EXTEND SECTION.
       USE AFTER ERROR PROCEDURE ON EXTEND.
       CONTINUE-EXTEND.
           CONTINUE.
       END DECLARATIVES.
	   
	   PROGRAMA SECTION.
	   INICIO.    
		   PERFORM ABRIR-ARCHIVO.
           PERFORM LEER-PROV.
		   PERFORM CICLO-IND UNTIL FS-CPR = 10.
		   PERFORM CERRAR-ARCHIVO.
		   STOP RUN.

	   ABRIR-ARCHIVO.
	   DISPLAY "ABRIENDO ARCHIVO".	  
	   OPEN INPUT CUITPROV.
	   IF FS-CPR NOT = ZERO	
		  DISPLAY "ERROR AL ABRIR PROVEEDORES INDEXADO: " FS-CPR
		  STOP RUN.
		  
	   LEER-PROV.	   
	   READ CUITPROV NEXT RECORD INTO CPR.
	   IF FS-CPR NOT = ZERO AND 10
		  DISPLAY "ERROR AL LEER PROVEEDORESI: " FS-CPR	
		  STOP RUN.
		  
	   CICLO-IND.
	   DISPLAY "REGISTRO LEIDO: " CPR.
	   PERFORM LEER-PROV.
		  
	   CERRAR-ARCHIVO.
	   DISPLAY "CERRAR-ARCHIVO".	   
	   CLOSE CUITPROV.	