       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEEPROV.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
           SELECT PROV ASSIGN TO DISK
                                ORGANIZATION IS INDEXED
                                ACCESS MODE IS SEQUENTIAL
                                RECORD KEY IS PRO-CLAVE
                                FILE STATUS IS FS-PROV.
								
       DATA DIVISION.
       FILE SECTION.               

       FD PROV LABEL RECORD IS STANDARD
                   VALUE OF FILE-ID IS 
                   "C:\PROVS\prov.dat".
       
       01 PRO.
           03 PRO-CLAVE.              
              05 CPR-COD-PROV          PIC 9(08).
	   03 PRO-DIRECCION                PIC X(30).
	   03 PRO-TELEFONO                 PIC X(15).
	   03 PRO-RUBRO                    PIC 9(04).
	   03 PRO-DESCRIP-RUBRO            PIC X(15).	   
	   03 PRO-FECHA-ALTA               PIC 9(08).
	   03 PRO-CANT-CONS-ASIG           PIC 9(03).   

       WORKING-STORAGE SECTION.       
       77 FS-PROV                PIC XX.       
                
       PROCEDURE DIVISION.
       DECLARATIVES.
       DECLAR-INPUT SECTION.
       USE AFTER ERROR PROCEDURE ON INPUT.
       CONTINUE-INPUT.
           CONTINUE.
       DECLAR-OUTPUT SECTION.
       USE AFTER ERROR PROCEDURE ON OUTPUT.
       CONTINUE-OUTPUT.
           CONTINUE.
       DECLAR-IO SECTION.
       USE AFTER ERROR PROCEDURE ON I-O.
       CONTINUE-IO.
           CONTINUE.
       DECLAR-EXTEND SECTION.
       USE AFTER ERROR PROCEDURE ON EXTEND.
       CONTINUE-EXTEND.
           CONTINUE.
       END DECLARATIVES.
	   
	   PROGRAMA SECTION.
	   INICIO.    
		   PERFORM ABRIR-ARCHIVO.
           PERFORM LEER-PROV.
		   PERFORM CICLO-IND UNTIL FS-PROV = 10.
		   PERFORM CERRAR-ARCHIVO.
		   STOP RUN.

	   ABRIR-ARCHIVO.
	   DISPLAY "ABRIENDO ARCHIVO".	  
	   OPEN INPUT PROV.
	   IF FS-PROV NOT = ZERO	
		  DISPLAY "ERROR AL ABRIR PROVEEDORES : " FS-PROV
		  STOP RUN.
		  
	   LEER-PROV.	   
	   READ PROV NEXT RECORD INTO PRO.	   
	   IF FS-PROV NOT = ZERO AND 10
		  DISPLAY "ERROR AL LEER PROVEEDORESI: " FS-PROV
		  STOP RUN.
	   
		  
	   CICLO-IND.
	   DISPLAY "REGISTRO LEIDO: " PRO.
	   PERFORM LEER-PROV.
		  
	   CERRAR-ARCHIVO.
	   DISPLAY "CERRAR-ARCHIVO".	   
	   CLOSE PROV.	